###############################################################################
# Created by write_sdc
# Mon Nov 27 12:10:42 2023
###############################################################################
current_design solo_squash_caravel_gf180
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name wb_clk_i -period 40.0000 [get_ports {wb_clk_i}]
set_clock_transition 0.1500 [get_clocks {wb_clk_i}]
set_clock_uncertainty 0.2500 wb_clk_i
set_propagated_clock [get_clocks {wb_clk_i}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {down_key_n}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ext_reset_n}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_ready}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {new_game_n}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {pause_n}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {up_key_n}]
set_input_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wb_rst_i}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {blue}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {debug_design_reset}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {debug_gpio_ready}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {green}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {hsync}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[0]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[10]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[11]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[12]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[13]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[14]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[15]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[16]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[17]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[18]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[19]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[1]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[20]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[21]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[22]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[23]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[24]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[25]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[26]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[27]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[28]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[29]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[2]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[30]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[31]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[32]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[33]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[34]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[35]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[36]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[37]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[3]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[4]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[5]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[6]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[7]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[8]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {io_oeb[9]}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {red}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {speaker}]
set_output_delay 8.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {vsync}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {blue}]
set_load -pin_load 0.0729 [get_ports {debug_design_reset}]
set_load -pin_load 0.0729 [get_ports {debug_gpio_ready}]
set_load -pin_load 0.0729 [get_ports {green}]
set_load -pin_load 0.0729 [get_ports {hsync}]
set_load -pin_load 0.0729 [get_ports {red}]
set_load -pin_load 0.0729 [get_ports {speaker}]
set_load -pin_load 0.0729 [get_ports {vsync}]
set_load -pin_load 0.0729 [get_ports {io_oeb[37]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[36]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[35]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[34]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[33]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[32]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[31]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[30]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[29]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[28]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[27]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[26]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[25]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[24]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[23]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[22]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[21]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[20]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[19]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[18]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[17]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[16]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[15]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[14]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[13]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[12]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[11]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[10]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[9]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[8]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[7]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[6]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[5]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[4]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[3]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[2]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[1]}]
set_load -pin_load 0.0729 [get_ports {io_oeb[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {down_key_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ext_reset_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_ready}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_game_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pause_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {up_key_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wb_clk_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wb_rst_i}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
